app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "description", "created_at", "updated_at", "img_url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    if @book.save

UPDATE "books" SET "updated_at" = $1, "img_url" = $2 WHERE "books"."id" = $3  [["updated_at", "2021-06-25 13:43:49.166948"], ["img_url", "https://images-na.ssl-images-amazon.com/images/I/41L0svyb0sL._SX327_BO1,204,203,200_.jpg"], ["id", 1]]
---
  def update
    if @book.update(book_params)