app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings"
---
  def index
    @ratings = Rating.all

INSERT INTO "ratings" ("number_of_stars", "book_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number_of_stars", 5], ["book_id", 1], ["user_id", 1], ["created_at", "2021-06-26 21:29:54.108231"], ["updated_at", "2021-06-26 21:29:54.108231"]]
---
  def create
    @rating = Rating.new(rating_params)
    @rating.user = @current_user

    if @rating.save